{"timestamp":1738072955831,"data":[{"title":"United States","content":"United States Durable Goods Orders\nNew orders for manufactured durable goods in the US fell 2.2% month-over-month to $276.1 billion in December 2024, following a downwardly revised 2% drop in November and much worse than market forecasts of a 0.6% increase. Transportation equipment led the decline, down 7.4%. Excluding transportation, durable goods increased 0.3%. Excluding defense, new orders decreased 2.4%. Orders were also lower for capital goods (-7.1%) and primary metals (-0.6%). Meanwhile, orders for non-defense capital goods excluding aircraft, a closely watched proxy for business spending plans, were up 0.5%, following a 0.9% rise in November.\n30 minutes ago\nSysco earnings above expectations at 0.93 USD\nUnited States Earnings\nSysco (SYY) released earnings per share at 0.93 USD, compared to market expectations of 0.92 USD.\nPACCAR earnings below expectations at 1.66 USD\nUnited States Earnings\nPACCAR (PCAR) released earnings per share at 1.66 USD, compared to market expectations of 1.70 USD.\n56 minutes ago\nLockheed Martin earnings above expectations at 7.67 USD\nUnited States Earnings\nLockheed Martin (LMT) released earnings per share at 7.67 USD, compared to market expectations of 6.58 USD.\n86 minutes ago\nRaytheon Technologies earnings above expectations at 1.54 USD\nUnited States Earnings\nRaytheon Technologies (RTX) released earnings per share at 1.54 USD, compared to market expectations of 1.38 USD.\n112 minutes ago\nBoeing earnings below expectations at -5.90 USD\nUnited States Earnings\nBoeing (BA) released earnings per share at -5.90 USD, compared to market expectations of -1.74 USD.\n116 minutes ago\nKimberly Clark earnings below expectations at 1.50 USD\nUnited States Earnings\nKimberly Clark (KMB) released earnings per share at 1.50 USD, compared to market expectations of 1.51 USD.\n2 hours ago\nRoyal Caribbean Cruises earnings above expectations at 1.63 USD\nUnited States Earnings\nRoyal Caribbean Cruises (RCL) released earnings per share at 1.63 USD, compared to market expectations of 1.49 USD.\n2 hours ago\nGeneral Motors earnings above expectations at 1.92 USD\nUnited States Earnings\nGeneral Motors (GM) released earnings per share at 1.92 USD, compared to market expectations of 1.72 USD.\n2 hours ago\nS&P and Nasdaq Set to Rebound\nUnited States Stock Market\nS&P 500 futures climbed 0.3%, and Nasdaq 100 futures rose 0.4%, while the Dow Jones hovered near the flatline on Tuesday, as markets sought to recover from Monday’s sharp sell-off. The downturn was driven by concerns over the US's AI dominance amid rising competition from Chinese DeepSeek. Nvidia shares rose around 5% in premarket trading, recovering some losses after a staggering 16.9% drop on Monday that wiped nearly $600 billion off its market cap, the largest one-day loss for a US company in history. Broadcom (+3.6%) and AMD (+0.6%) also saw premarket gains. Meanwhile, earnings reports will remain in focus, with shares of Boeing trading little changed before the opening bell after the company's earnings and revenue missed forecasts. Lockheed Martin sank about 4% after its revenue for Q4 and and FY 2025 EPS guidance disappointed. Starbucks is also scheduled to release quarterly results today. Investors are also eyeing the Fed, which begins its two-day policy meeting later today.\n3 hours ago\nUS 10-Year Yield Rises Ahead of Fed Meeting\nUnited States Government Bond 10Y\nThe yield on the US 10-year Treasury note climbed above 4.55% on Tuesday, recovering from a roughly ten basis point drop in the previous session as investors prepared for the latest Federal Reserve policy decision. The central bank is widely expected to keep interest rates unchanged, despite President Trump’s calls to lower borrowing costs “immediately.” Investors are closely watching the Fed’s inflation outlook for signals on when the next rate cut may occur. Markets are also anticipating Friday’s PCE price index report, the Fed’s preferred inflation gauge. Meanwhile, Treasury yields came under pressure on Monday as concerns over Chinese startup DeepSeek’s challenge to US AI dominance sparked a wave of risk-off trades. Investors also factored in Trump’s escalating tariff threats ahead of the February 1 deadline he previously announced.\n8 hours ago\nDollar Rises on Fresh Tariff Threats\nUnited States Currency\nThe dollar index climbed above 107.8 on Tuesday, rebounding from six-week lows as President Donald Trump ramped up his tariff threats. Trump announced plans to impose tariffs on imported computer chips, pharmaceuticals, and steel, aiming to encourage domestic production of these goods. Traders also became more cautious as the February 1 deadline for the first round of tariffs, as previously outlined by the President, draws near. Meanwhile, the Federal Reserve began its two-day policy meeting on Tuesday, with expectations that it will hold interest rates steady despite Trump’s calls for immediate rate cuts. Investors are focusing on the central bank’s inflation outlook for signals on when the next rate cut may occur. The dollar strengthened against a range of currencies, with the biggest gains against the euro and yen.\n12 hours ago\nUS Futures Stabilize After Sharp Selloff\nUnited States Stock Market\nUS stock futures steadied on Tuesday following a sharp selloff in the previous session, particularly in artificial intelligence-related stocks, as concerns over a new AI competitor from China intensified. Chinese startup DeepSeek recently launched a free, open-source large language model that utilizes cheaper chips, less data, and lower energy consumption, sparking fears that US AI leaders could lose their competitive edge. On Monday, the S&P 500 and Nasdaq Composite tumbled 1.46% and 3.07%, respectively, with AI-focused stocks and those in the AI supply chain leading the decline. Notable drops included Nvidia (-17%), Broadcom (-17.4%), Oracle (-13.8%), Vertiv Holdings (-29.9%), and Vistra Corp (-28.3%). In contrast, the Dow gained 0.65%, buoyed by gains in defensive sectors amid falling bond yields. Investors now turn their attention to upcoming earnings reports, the latest Federal Reserve decision, and an important inflation reading later this week.\n14 hours ago\nThe Dow Jones Index Closes 0.59% Higher\nUnited States Stock Market\nIn New York, the Dow Jones Index rose 264 points or 0.59 percent on Monday. Leading the gains are Salesforce (4.20%), J&J (4.19%) and Travelers Companies (4.09%). Top losers were Nvidia (-16.78%), Cisco Systems (-5.08%) and Caterpillar (-3.24%).\n16 hours ago\nUS Stocks Drop on AI Concerns, Nvidia Falls 16.8%\nUnited States Stock Market\nU.S. stocks, particularly in the tech sector, plunged on Monday, with chipmakers like Nvidia falling 16.8%, while Broadcom, Oracle, and Arista lost between 13.8% and 22.4%. The Nasdaq and S&P 500 closed down 2.8% and 1.3%, respectively, after rising concerns over a new AI competitor from China. The Chinese startup DeepSeek’s AI Assistant overtook ChatGPT on Apple’s App Store, sparking fears that U.S. AI leaders could lose their dominance. DeepSeek’s model, which uses cheaper chips and less data, is seen as a potential disruptor to the AI supply chain, affecting semiconductor firms and data centers. Other major tech stocks, including Microsoft and Alphabet, also declined. Meanwhile, defensive sectors saw gains, aided by a drop in bond yields, helping the Dow close 310 points higher. Looking ahead, the Federal Reserve is expected to keep rates unchanged on Wednesday, with key data releases, including GDP growth and PCE inflation figures, drawing investor focus.\n17 hours ago\nBoston Scientific Hits All-time High\nUnited States stocks\nBoston Scientific increased to an all-time high of 102.16 USD. Over the past 4 weeks, Boston Scientific gained 11.59%, and in the last 12 months, it increased 67.89%.\n19 hours ago\nWalt Disney Hits 5-week High\nUnited States stocks\nWalt Disney increased to a 5-week high of 113.78 USD. Over the past 4 weeks, Walt Disney gained 2.38%, and in the last 12 months, it increased 16.51%.\n19 hours ago\nTJX Companies Hits 4-week High\nUnited States stocks\nTJX Companies increased to a 4-week high of 124.50 USD. Over the past 4 weeks, TJX Companies lost 0.5%, and in the last 12 months, it increased 30.31%.\n19 hours ago\nAT&T Hits 35-month High\nUnited States stocks\nAT&T increased to a 35-month high of 24.34 USD. Over the past 4 weeks, AT&T gained 5.88%, and in the last 12 months, it increased 41.56%.\n19 hours ago\nP&G Hits 4-week High\nUnited States stocks\nP&G increased to a 4-week high of 168.71 USD. Over the past 4 weeks, Procter & Gamble gained 0.87%, and in the last 12 months, it increased 7.99%.\n20 hours ago","url":"https://tradingeconomics.com/stream?c=united+states","publishedAt":"Tue, 28 Jan 2025 13:11:00 GMT","source":"Trading Economics","category":"article","sentiment":{"score":0,"label":"neutral","confidence":0},"summary":"United States Durable Goods Orders\nNew orders for manufactured durable goods in the US fell 2.2% month-over-month to $276.1 billion in December 2024, following a downwardly revised 2% drop in November and much worse than market forecasts of a 0.6% increase. Transportation equipment led the decline, down 7.4%. Excluding transportation, durable goods increased 0.3%. Excluding defense, new orders decreased 2.4%. Orders were also lower for capital goods (-7.1%) and primary metals (-0.6%). Meanwhile,","author":"Trading Economics","id":"te-1738072955830-0"}]}